inblat/STM32_FOC_ACIM/src/MC_Display.c
/******************** (C) COPYRIGHT 2007 STMicroelectronics ********************
* File Name          : MC_Display.c
* Author             : IMS Systems Lab 
* Date First Issued  : 11/28/2007
* Description        : This file contains the software implementation of the
*                      display routines
********************************************************************************
* History:
* 11/28/07 v1.0
* 05/29/08 v2.0
********************************************************************************
* THE PRESENT SOFTWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
* WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE TIME.
* AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY DIRECT,
* INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE
* CONTENT OF SUCH SOFTWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING
* INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
*
* THIS SOURCE CODE IS PROTECTED BY A LICENSE.
* FOR MORE INFORMATION PLEASE CAREFULLY READ THE LICENSE AGREEMENT FILE LOCATED
* IN THE ROOT DIRECTORY OF THIS FIRMWARE PACKAGE.
*******************************************************************************/
/* Standard include ----------------------------------------------------------*/
#include "stm32f10x_lib.h"  

/* Include of other module interface headers ---------------------------------*/
/* Local includes ------------------------------------------------------------*/

#include "stm32f10x_MClib.h"
#include "MC_Globals.h"

// extern u8 bMenu_index;

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#define BLINKING_TIME   5  // 5 * timebase_display_5 ms

#define VISUALIZATION_1   (u8)1
#define VISUALIZATION_2   (u8)2
#define VISUALIZATION_3   (u8)3
#define VISUALIZATION_4   (u8)4
#define VISUALIZATION_5   (u8)5
#define VISUALIZATION_6   (u8)6
#define VISUALIZATION_7   (u8)7
#define VISUALIZATION_8   (u8)8
#define VISUALIZATION_9   (u8)9
#define VISUALIZATION_10  (u8)10

#define CHAR_0            (u8)0 //First character of the line starting from the left
#define CHAR_1            (u8)1 
#define CHAR_2            (u8)2
#define CHAR_3            (u8)3
#define CHAR_4            (u8)4
#define CHAR_5            (u8)5
#define CHAR_6            (u8)6
#define CHAR_7            (u8)7
#define CHAR_8            (u8)8
#define CHAR_9            (u8)9
#define CHAR_10           (u8)10
#define CHAR_11           (u8)11
#define CHAR_12           (u8)12
#define CHAR_13           (u8)13
#define CHAR_14           (u8)14
#define CHAR_15           (u8)15
#define CHAR_16           (u8)16
#define CHAR_17           (u8)17
#define CHAR_18           (u8)18
#ifdef DAC_FUNCTIONALITY
#define CHAR_19           (u8)19
#endif

/* Private macro -------------------------------------------------------------*/
/* Private functions ---------------------------------------------------------*/
void Display_5DigitSignedNumber(u8, u8, s16);
u8 ComputeVisualization(u8 );

/* Private variables ---------------------------------------------------------*/
volatile static u16 hTimebase_Blinking;
static u8 bPrevious_Visualization = 0;
static u8 bPresent_Visualization;

/*******************************************************************************
* Function Name  : Display_Welcome_Message
* Description    : Welcome message on LCD after power-up
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/

void Display_Welcome_Message(void)
{
  u8 *ptr = " STM32 Motor Control";
  
  LCD_DisplayStringLine(Line0, ptr);
  
  ptr = "  ACIM IFOC ver 2.0  ";
  LCD_DisplayStringLine(Line1, ptr);
    
  ptr = " <> Move  ^| Change ";
  LCD_DisplayStringLine(Line9, ptr);            
}  

/*******************************************************************************
* Function Name  : Display_LCD
* Description    : Display routine for LCD management
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/

void Display_LCD(void)
{          
  if (TB_DisplayDelay_IsElapsed() == TRUE) 
  { 
    TB_Set_DisplayDelay_500us(500);  //  refresh LCD every 400*5 = 200 ms

    bPrevious_Visualization = bPresent_Visualization;

    bPresent_Visualization = ComputeVisualization(bMenu_index);
  
    switch(bPresent_Visualization)
    {
      u8 *ptr;
      s16 temp;
            
      case(VISUALIZATION_1):
        if (bPresent_Visualization != bPrevious_Visualization)
        {           
          LCD_ClearLine(Line2);
          
          LCD_ClearLine(Line3); 
          
          LCD_ClearLine(Line4); 
                   
          ptr = " Target     Measured";
          LCD_DisplayStringLine(Line5,ptr); 
          
          ptr = "       (rpm)        ";
          LCD_DisplayStringLine(Line7,ptr); 
          
          LCD_ClearLine(Line6);
          
          LCD_ClearLine(Line8);
          
          ptr = " <> Move  ^| Change ";          
          LCD_DisplayStringLine(Line9, ptr); 
        }
        
        if(bMenu_index == CONTROL_MODE_MENU_1)
        {
          LCD_SetTextColor(Red);
        }
        
        ptr = " Speed Control Mode";        
        LCD_DisplayStringLine(Line3,ptr);
        
        if(bMenu_index == CONTROL_MODE_MENU_1)
        {
          LCD_SetTextColor(Blue);
        }
        else //REF_SPEED_MENU
        {
          LCD_SetTextColor(Red);
        }
          
        //Compute target speed in rpm
        temp = (s16)(hSpeed_Reference * 6);          
        
        Display_5DigitSignedNumber(Line7, CHAR_0, temp);
        
        if(bMenu_index != CONTROL_MODE_MENU_1)
        {
          LCD_SetTextColor(Blue);
        }
         
        //Compute measured speed in rpm
#ifdef ENCODER
        temp = (s16)(ENC_Get_Mechanical_Speed() * 6);
#elif defined(TACHO)
        temp = (s16)(TAC_GetRotorFreqInHz()*6);
#endif        
        
