inblat/STM32_FOC_ACIM/src/MC_Display.c
        Display_5DigitSignedNumber(Line7, CHAR_13, temp);    
                      
      break;
          
      case(VISUALIZATION_2):
        if (bPresent_Visualization != bPrevious_Visualization)
        {           
          ptr = "       Speed        ";
          LCD_DisplayStringLine(Line2,ptr);
          
          ptr = "    P     I     D   ";
          LCD_DisplayStringLine(Line3,ptr); 
          
          LCD_ClearLine(Line4);
          LCD_ClearLine(Line5);
           
          ptr = " Target        (rpm)";
          LCD_DisplayStringLine(Line6,ptr); 
          
          ptr = " Measured      (rpm)";
          LCD_DisplayStringLine(Line7,ptr);
          
          LCD_ClearLine(Line8);
          
          ptr = " <> Move  ^| Change ";          
          LCD_DisplayStringLine(Line9, ptr); 
        }
        
        switch(bMenu_index)
        {
          case(P_SPEED_MENU):
            LCD_SetTextColor(Red);            
            temp = PID_Speed_InitStructure.hKp_Gain;
            Display_5DigitSignedNumber(Line4, CHAR_1, temp);
            LCD_SetTextColor(Blue);
            
            temp = PID_Speed_InitStructure.hKi_Gain;
            Display_5DigitSignedNumber(Line4, CHAR_7, temp);
            
#ifdef DIFFERENTIAL_TERM_ENABLED            
            temp = PID_Speed_InitStructure.hKd_Gain;
            Display_5DigitSignedNumber(Line4, CHAR_13, temp);
#else        
            {
              u32 i=0;
              for( i=0; i<5; i++)
              {
                LCD_DisplayChar(Line4, (u16)(320 -(16*(18-i))),'-');
              }
            }
#endif         
          
          break;
            
          case(I_SPEED_MENU):                                 
            temp = PID_Speed_InitStructure.hKp_Gain;
            Display_5DigitSignedNumber(Line4, CHAR_1, temp);
            
            LCD_SetTextColor(Red);   
            temp = PID_Speed_InitStructure.hKi_Gain;
            Display_5DigitSignedNumber(Line4, CHAR_7, temp);
            LCD_SetTextColor(Blue);
            
#ifdef DIFFERENTIAL_TERM_ENABLED            
            temp = PID_Speed_InitStructure.hKd_Gain;
            Display_5DigitSignedNumber(Line4, CHAR_13, temp);
#else        
            {
              u32 i=0;
              for( i=0; i<5; i++)
              {
                LCD_DisplayChar(Line4, (u16)(320 -(16*(18-i))),'-');
              }
            }
#endif
          
          break;
          
#ifdef DIFFERENTIAL_TERM_ENABLED
            case(D_SPEED_MENU):
              temp = PID_Speed_InitStructure.hKp_Gain;
              Display_5DigitSignedNumber(Line4, CHAR_1, temp);
              
              temp = PID_Speed_InitStructure.hKi_Gain;
              Display_5DigitSignedNumber(Line4, CHAR_7, temp);
              
              LCD_SetTextColor(Red);
              temp = PID_Speed_InitStructure.hKd_Gain;
              Display_5DigitSignedNumber(Line4, CHAR_13, temp);
              LCD_SetTextColor(Blue);
          
          break;
#endif
        default:
          break;
        }
        //Independently from the menu, this visualization must display current 
        //and measured speeds
        
        //Display target speed in rpm
        temp = (s16)(hSpeed_Reference * 6);          
        Display_5DigitSignedNumber(Line6, CHAR_9, temp);
        
        //Compute measured speed in rpm

#ifdef ENCODER
        temp = (s16)(ENC_Get_Mechanical_Speed() * 6);
#elif defined(TACHO)
        temp = (s16)(TAC_GetRotorFreqInHz()*6);
#endif    
        
        Display_5DigitSignedNumber(Line7, CHAR_9, temp);         
      break;
      
      case(VISUALIZATION_3):
        if (bPresent_Visualization != bPrevious_Visualization)
        {           
          ptr = "       Torque       ";
          LCD_DisplayStringLine(Line2,ptr);
          
          ptr = "    P     I     D   ";
          LCD_DisplayStringLine(Line3,ptr); 
          
          LCD_ClearLine(Line4);
          LCD_ClearLine(Line5);
           
          ptr = " Target         (Iq)";
          LCD_DisplayStringLine(Line6,ptr); 
          
          ptr = " Measured       (Iq)";
          LCD_DisplayStringLine(Line7,ptr);
          
          LCD_ClearLine(Line8);
          
          ptr = " <> Move  ^| Change ";          
          LCD_DisplayStringLine(Line9, ptr); 
        }
        
        switch(bMenu_index)
        {
          case(P_TORQUE_MENU):
            LCD_SetTextColor(Red);            
            temp = PID_Torque_InitStructure.hKp_Gain;
            Display_5DigitSignedNumber(Line4, CHAR_1, temp);
            LCD_SetTextColor(Blue);
            
            temp = PID_Torque_InitStructure.hKi_Gain;
            Display_5DigitSignedNumber(Line4, CHAR_7, temp);
            
#ifdef DIFFERENTIAL_TERM_ENABLED            
            temp = PID_Torque_InitStructure.hKd_Gain;
            Display_5DigitSignedNumber(Line4, CHAR_13, temp);
#else        
            {
              u32 i=0;
              for( i=0; i<5; i++)
              {
                LCD_DisplayChar(Line4, (u16)(320 -(16*(18-i))),'-');
              }
            }
#endif       
          
          break;
            
          case(I_TORQUE_MENU):                                 
            temp = PID_Torque_InitStructure.hKp_Gain;
            Display_5DigitSignedNumber(Line4, CHAR_1, temp);
            
            LCD_SetTextColor(Red);   
            temp = PID_Torque_InitStructure.hKi_Gain;
            Display_5DigitSignedNumber(Line4, CHAR_7, temp);
            LCD_SetTextColor(Blue);
            
#ifdef DIFFERENTIAL_TERM_ENABLED             
            temp = PID_Torque_InitStructure.hKd_Gain;
            Display_5DigitSignedNumber(Line4, CHAR_13, temp);
#else        
            {
              u32 i=0;
              for( i=0; i<5; i++)
              {
                LCD_DisplayChar(Line4, (u16)(320 -(16*(18-i))),'-');
              }
            }
#endif
          
          break;
          
#ifdef DIFFERENTIAL_TERM_ENABLED 
            case(D_TORQUE_MENU):
              temp = PID_Torque_InitStructure.hKp_Gain;
              Display_5DigitSignedNumber(Line4, CHAR_1, temp);
              
              temp = PID_Torque_InitStructure.hKi_Gain;
              Display_5DigitSignedNumber(Line4, CHAR_7, temp);
              
              LCD_SetTextColor(Red);
              temp = PID_Torque_InitStructure.hKd_Gain;
              Display_5DigitSignedNumber(Line4, CHAR_13, temp);
              LCD_SetTextColor(Blue);
              
              
            break;
#endif
        default:
          break;
        }
        //Independently from the menu, this visualization must display current 
        //and measured Iq
        
        temp = hTorque_Reference;          
        Display_5DigitSignedNumber(Line6, CHAR_9, temp);

