inblat/STM32_FOC_ACIM/src/MC_Display.c
        temp = Stat_Curr_q_d.qI_Component1;
        Display_5DigitSignedNumber(Line7, CHAR_9, temp);        
      break;
     
      case(VISUALIZATION_4):
        if (bPresent_Visualization != bPrevious_Visualization)
        {           
          ptr = "        Flux        ";
          LCD_DisplayStringLine(Line2,ptr);
          
          ptr = "    P     I     D   ";
          LCD_DisplayStringLine(Line3,ptr); 
          
         
          
          LCD_ClearLine(Line4);
          LCD_ClearLine(Line5);
           
          ptr = " Target         (Id)";
          LCD_DisplayStringLine(Line6,ptr); 
          
          ptr = " Measured       (Id)";
          LCD_DisplayStringLine(Line7,ptr);
          
                   
          LCD_ClearLine(Line8);
          
          ptr = " <> Move  ^| Change ";          
          LCD_DisplayStringLine(Line9, ptr); 
        }
        
        switch(bMenu_index)
        {
          case(P_FLUX_MENU):
            LCD_SetTextColor(Red);            
            temp = PID_Flux_InitStructure.hKp_Gain;
            Display_5DigitSignedNumber(Line4, CHAR_1, temp);
            LCD_SetTextColor(Blue);
            
            temp = PID_Flux_InitStructure.hKi_Gain;
            Display_5DigitSignedNumber(Line4, CHAR_7, temp);
            
#ifdef DIFFERENTIAL_TERM_ENABLED            
            temp = PID_Flux_InitStructure.hKd_Gain;
            Display_5DigitSignedNumber(Line4, CHAR_13, temp);
#else        
            {
              u32 i=0;
              for( i=0; i<5; i++)
              {
                LCD_DisplayChar(Line4, (u16)(320 -(16*(18-i))),'-');
              }
            }
#endif       
            
          break;
            
          case(I_FLUX_MENU):                                 
            temp = PID_Flux_InitStructure.hKp_Gain;
            Display_5DigitSignedNumber(Line4, CHAR_1, temp);
            
            LCD_SetTextColor(Red);   
            temp = PID_Flux_InitStructure.hKi_Gain;
            Display_5DigitSignedNumber(Line4, CHAR_7, temp);
            LCD_SetTextColor(Blue);
            
#ifdef DIFFERENTIAL_TERM_ENABLED             
            temp = PID_Flux_InitStructure.hKd_Gain;
            Display_5DigitSignedNumber(Line4, CHAR_13, temp);
#else        
            {
              u32 i=0;
              for( i=0; i<5; i++)
              {
                LCD_DisplayChar(Line4, (u16)(320 -(16*(18-i))),'-');
              }
            }
#endif
            
            break;
            
#ifdef DIFFERENTIAL_TERM_ENABLED 
            case(D_FLUX_MENU):
              temp = PID_Flux_InitStructure.hKp_Gain;
              Display_5DigitSignedNumber(Line4, CHAR_1, temp);
              
              temp = PID_Flux_InitStructure.hKi_Gain;
              Display_5DigitSignedNumber(Line4, CHAR_7, temp);
              
              LCD_SetTextColor(Red);
              temp = PID_Flux_InitStructure.hKd_Gain;
              Display_5DigitSignedNumber(Line4, CHAR_13, temp);
              LCD_SetTextColor(Blue);
              
            
            break;
#endif
        default:
          break;
        }
        //Independently from the menu, this visualization must display current 
        //and measured Id
        
        temp = hFlux_Reference;          
        Display_5DigitSignedNumber(Line6, CHAR_9, temp);

        temp = Stat_Curr_q_d.qI_Component2;
        Display_5DigitSignedNumber(Line7, CHAR_9, temp);   
      break;
      
      case(VISUALIZATION_5):
        if (bPresent_Visualization != bPrevious_Visualization)
        {           
          LCD_ClearLine(Line2);
          
          ptr = " Power Stage Status ";          
          LCD_DisplayStringLine(Line3, ptr); 
          
          LCD_ClearLine(Line4);
          
          ptr = "  DC bus =     Volt ";          
          LCD_DisplayStringLine(Line5, ptr); 
          
          LCD_ClearLine(Line6);
          
          ptr = "  T =      Celsius  ";          
          LCD_DisplayStringLine(Line7, ptr); 
          
          LCD_ClearLine(Line8);
          
          ptr = " <> Move            ";          
          LCD_DisplayStringLine(Line9, ptr); 
        }
      
        temp = MCL_Compute_BusVolt();        
        LCD_DisplayChar(Line5, 320-16*CHAR_11, (u8)(((temp%1000)/100)+0x30));
        LCD_DisplayChar(Line5, 320-16*CHAR_12, (u8)(((temp%100)/10)+0x30));
        LCD_DisplayChar(Line5, 320-16*CHAR_13, (u8)((temp%10)+0x30));
        
        temp = MCL_Compute_Temp(); 
        LCD_DisplayChar(Line7, 320-16*CHAR_6, (u8)(((temp%1000)/100)+0x30));
        LCD_DisplayChar(Line7, 320-16*CHAR_7, (u8)(((temp%100)/10)+0x30));
        LCD_DisplayChar(Line7, 320-16*CHAR_8, (u8)((temp%10)+0x30));
      
      break;    
        
      case(VISUALIZATION_6):
        if (bPresent_Visualization != bPrevious_Visualization)
        {           
          LCD_ClearLine(Line2);
          
          LCD_ClearLine(Line3); 
          

          
          ptr = "     Target Measured";
          LCD_DisplayStringLine(Line4,ptr);
          
          ptr = "Iq                  ";
          LCD_DisplayStringLine(Line5,ptr); 
          
          ptr = "Id                  ";
          LCD_DisplayStringLine(Line6,ptr);
          
          ptr = "Speed (rpm)         ";
          LCD_DisplayStringLine(Line7,ptr);
          
          LCD_ClearLine(Line8);
          
          ptr = " <> Move  ^| Change ";          
          LCD_DisplayStringLine(Line9, ptr); 
        }
        
        switch(bMenu_index)
        {
          case(CONTROL_MODE_MENU_6):
            LCD_SetTextColor(Red);
            ptr = "Torque Control Mode ";        
            LCD_DisplayStringLine(Line3,ptr);  
            LCD_SetTextColor(Blue);
            
            temp = hTorque_Reference;
            Display_5DigitSignedNumber(Line5, CHAR_5, temp);
 
