inblat/STM32_FOC_ACIM/src/MC_Display.c
            temp = hFlux_Reference; 
            Display_5DigitSignedNumber(Line6, CHAR_5, temp);         
          break;   
          
          case(IQ_REF_MENU):
            ptr = "Torque Control Mode "; 
            LCD_DisplayStringLine(Line3,ptr); 
            
            LCD_SetTextColor(Red);
            temp = hTorque_Reference;
            Display_5DigitSignedNumber(Line5, CHAR_5, temp);
            LCD_SetTextColor(Blue);
            
            temp = hFlux_Reference; 
            Display_5DigitSignedNumber(Line6, CHAR_5, temp); 
          break;
            
          case(ID_REF_MENU):
            ptr = "Torque Control Mode "; 
            LCD_DisplayStringLine(Line3,ptr); 
            
            temp = hTorque_Reference;
            Display_5DigitSignedNumber(Line5, CHAR_5, temp);
            
            LCD_SetTextColor(Red);
            temp = hFlux_Reference; 
            Display_5DigitSignedNumber(Line6, CHAR_5, temp); 
            LCD_SetTextColor(Blue);
          break;
         default: 
          break;
        }            
        temp =Stat_Curr_q_d.qI_Component1;
        Display_5DigitSignedNumber(Line5, CHAR_13, temp);
        
        temp =Stat_Curr_q_d.qI_Component2;        
        Display_5DigitSignedNumber(Line6, CHAR_13, temp);

        //Compute measured speed in rpm
#ifdef ENCODER
        temp = (s16)(ENC_Get_Mechanical_Speed() * 6);
#elif defined(TACHO)
        temp = (s16)(TAC_GetRotorFreqInHz()*6);
#endif    
             
        Display_5DigitSignedNumber(Line7, CHAR_13, temp);
      break;
        
      case(VISUALIZATION_7):
                if (bPresent_Visualization != bPrevious_Visualization)
        {  
          LCD_ClearLine(Line2);
          
          LCD_SetTextColor(Red);
          ptr = "    !!! FAULT !!!   ";
          LCD_DisplayStringLine(Line3,ptr);
          LCD_SetTextColor(Blue);
         
          if ( (wGlobal_Flags & UNDER_VOLTAGE) == UNDER_VOLTAGE)
          {           
            ptr = " Bus Under Voltage  ";
            LCD_DisplayStringLine(Line4, ptr);                                   
          }
          else if ( (wGlobal_Flags & OVER_CURRENT) ==  OVER_CURRENT)
            {
              ptr = "   Over Current    ";
              LCD_DisplayStringLine(Line4, ptr); 
            }
          else if ( (wGlobal_Flags & OVERHEAT) ==  OVERHEAT)
            {
              ptr = "   Over Heating    ";
              LCD_DisplayStringLine(Line4, ptr);                             
            }
          else if ( (wGlobal_Flags & OVER_VOLTAGE) ==  OVER_VOLTAGE)
            {
              ptr = "  Bus Over Voltage  ";
              LCD_DisplayStringLine(Line4, ptr);               
            }
          else if ( (wGlobal_Flags & SPEED_FEEDBACK) ==  SPEED_FEEDBACK)
          {
             ptr = "  Start-up failed   ";
             LCD_DisplayStringLine(Line4, ptr);    
          }      
          else if ( (wGlobal_Flags & SPEED_FDBK_TIMED_OUT) ==  SPEED_FDBK_TIMED_OUT)
          {
             ptr = "Error on speed fdbck";
             LCD_DisplayStringLine(Line4, ptr);     
          }  
          LCD_ClearLine(Line5);
          LCD_ClearLine(Line7);  
        } 

        if ((wGlobal_Flags & ( OVERHEAT | UNDER_VOLTAGE | OVER_VOLTAGE)) == 0) 
        { 
          LCD_ClearLine(Line6);
          ptr = "   Press 'Key' to   ";
          LCD_DisplayStringLine(Line8,ptr);
          
          ptr = "   return to menu   ";
          LCD_DisplayStringLine(Line9,ptr);
        }
        else
        {
          if ((wGlobal_Flags & (UNDER_VOLTAGE | OVER_VOLTAGE)) ==0)    
          {//Under or over voltage
             if (bPresent_Visualization != bPrevious_Visualization)
             { 
               LCD_ClearLine(Line6);
             }
             temp = MCL_Compute_Temp(); 
             ptr = "       T =";  
             LCD_DisplayStringLine(Line6, ptr);
             LCD_DisplayChar(Line6, 320-16*CHAR_11, (u8)(((temp%1000)/100)+0x30));
             LCD_DisplayChar(Line6, 320-16*CHAR_12, (u8)(((temp%100)/10)+0x30));
             LCD_DisplayChar(Line6, 320-16*CHAR_13, (u8)((temp%10)+0x30));
             LCD_DisplayChar(Line6, 320-16*CHAR_14, ' ');
             LCD_DisplayChar(Line6, 320-16*CHAR_15, 'C');
          }
          else 
          {           
            if (bPresent_Visualization != bPrevious_Visualization)
            { 
              LCD_ClearLine(Line6);         
            }
            ptr = "  DC bus =";            
            LCD_DisplayStringLine(Line6, ptr); 
            temp = MCL_Compute_BusVolt();        
            LCD_DisplayChar(Line6, 320-16*CHAR_11, (u8)(((temp%1000)/100)+0x30));
            LCD_DisplayChar(Line6, 320-16*CHAR_12, (u8)(((temp%100)/10)+0x30));
            LCD_DisplayChar(Line6, 320-16*CHAR_13, (u8)((temp%10)+0x30)); 
            LCD_DisplayChar(Line6, 320-16*CHAR_14, ' ');
            LCD_DisplayChar(Line6, 320-16*CHAR_15, 'V');             
          }          
          LCD_ClearLine(Line8);
          LCD_ClearLine(Line9);
        }
      break;
	        case(VISUALIZATION_8):  
        if (bPresent_Visualization != bPrevious_Visualization)
        {  
          LCD_ClearLine(Line2);
          
          ptr = " Motor is stopping  ";
          LCD_DisplayStringLine(Line3,ptr);
          
          ptr = "   please wait...   ";
          LCD_DisplayStringLine(Line4,ptr);
          
          LCD_ClearLine(Line5);
          LCD_ClearLine(Line6);
          LCD_ClearLine(Line7);
          LCD_ClearLine(Line8);
          LCD_ClearLine(Line9);
        } 
      break;
#ifdef DAC_FUNCTIONALITY      
    case(VISUALIZATION_10):
      if (bPresent_Visualization != bPrevious_Visualization)
      {           
        LCD_ClearLine(Line2);
        
        ptr = "    Signal on PB0   ";
        LCD_DisplayStringLine(Line3,ptr); 
        
