inblat/STM32_FOC_ACIM/src/MC_Display.c
        LCD_ClearLine(Line4);
         
        LCD_ClearLine(Line5);
        
        ptr = "    Signal on PB1   ";
        LCD_DisplayStringLine(Line6,ptr);
        
        LCD_ClearLine(Line7);
        
        LCD_ClearLine(Line8);
        
        ptr = " <> Move  ^| Change ";          
        LCD_DisplayStringLine(Line9, ptr); 
      }
      
      switch(bMenu_index)
      {
        case(DAC_PB0_MENU):
          LCD_SetTextColor(Red);
          ptr = MCDAC_Output_Var_Name(DAC_CH1);
          LCD_DisplayStringLine(Line4, ptr);
          
          LCD_SetTextColor(Blue);
          ptr = MCDAC_Output_Var_Name(DAC_CH2);
          LCD_DisplayStringLine(Line7, ptr);
        break;
                   
         case(DAC_PB1_MENU):              
          ptr = MCDAC_Output_Var_Name(DAC_CH1);
          LCD_DisplayStringLine(Line4, ptr);
          
          LCD_SetTextColor(Red);
          ptr = MCDAC_Output_Var_Name(DAC_CH2);
          LCD_DisplayStringLine(Line7, ptr);
          LCD_SetTextColor(Blue);
        break;
        
        default:
         break;
      }
#endif
    default:
      break;
    }
  }
}

          
/*******************************************************************************
* Function Name  : Display_5DigitSignedNumber
* Description    : It Displays a 5 digit signed number in the specified line, 
*                  starting from a specified element of LCD display matrix 
* Input          : Line, starting point in LCD dysplay matrix, 5 digit signed
*                  number 
* Output         : None
* Return         : None
*******************************************************************************/

void Display_5DigitSignedNumber(u8 Line, u8 bFirstchar, s16 number)
{ u32 i;
  u16 h_aux=1;

  if (number<0)     
  {
    LCD_DisplayChar(Line,(u16)( 320-16*bFirstchar), '-');
    number = -number;
  }
  else 
  {
    LCD_DisplayChar(Line,(u16)( 320-16*bFirstchar), ' ');
  }
      
  for (i=0; i<4; i++)
  {
    LCD_DisplayChar(Line, (u16)(320 -(16*(bFirstchar+5-i))),
                                        (u8)(((number%(10*h_aux))/h_aux)+0x30));          
    h_aux *= 10;
  }
  LCD_DisplayChar(Line,(u16)(320-(16*(bFirstchar+1))), (u8)(((number/10000))+0x30));
}    

/*******************************************************************************
* Function Name  : ComputeVisualization
* Description    : Starting from the value of the bMenuIndex, this function 
*                  extract the information about the present menu to be 
*                  displayed on LCD
* Input          : bMenuIndex variable 
* Output         : Present visualization
* Return         : None
*******************************************************************************/

u8 ComputeVisualization(u8 bLocal_MenuIndex)
{  
  u8 bTemp;

    switch(bLocal_MenuIndex)
    {
      case(CONTROL_MODE_MENU_1):
      case(REF_SPEED_MENU):
        bTemp = VISUALIZATION_1;
      break;
      
      case(P_SPEED_MENU):
      case(I_SPEED_MENU):
#ifdef DIFFERENTIAL_TERM_ENABLED
      case(D_SPEED_MENU):
#endif        
        bTemp = VISUALIZATION_2; 
      break;

      case(P_TORQUE_MENU):
      case(I_TORQUE_MENU):
#ifdef DIFFERENTIAL_TERM_ENABLED
      case(D_TORQUE_MENU):
#endif        
        bTemp = VISUALIZATION_3; 
      break;     
      
      case(P_FLUX_MENU):
      case(I_FLUX_MENU):
#ifdef DIFFERENTIAL_TERM_ENABLED
      case(D_FLUX_MENU):
#endif        
        bTemp = VISUALIZATION_4; 
      break; 
      
      case(POWER_STAGE_MENU):
        bTemp = VISUALIZATION_5;
      break;
        
      case(CONTROL_MODE_MENU_6):
      case(IQ_REF_MENU):
      case(ID_REF_MENU):
        bTemp = VISUALIZATION_6;
      break;  
      
      case(FAULT_MENU):
        bTemp = VISUALIZATION_7;
      break;      
      
#ifdef DAC_FUNCTIONALITY
      case(DAC_PB0_MENU):
         bTemp = VISUALIZATION_10;
       break;   
       case(DAC_PB1_MENU):
         bTemp = VISUALIZATION_10;
       break;
#endif 
      default:
        bTemp = VISUALIZATION_1;
      break;      
    }    
      
    if (State == WAIT)
    {
      bTemp = VISUALIZATION_8;
    }

    return (bTemp);
}
      
/******************* (C) COPYRIGHT 2007 STMicroelectronics *****END OF FILE****/
